{
    "name": "Ichor Wheel",
    "type": "alien",
    "sections": [
        {
            "name": "Carrion Wheel",
            "type": "section",
            "html": "<b>Source</b><a class=\"external-link\" href=\"https://paizo.com/products/btq026jv?Starfinder-Alien-Archive-4\" target=\"_blank\"><i>Alien Archive 4 pg. 19</i></a><br/>Carrion wheels are furiously writhing masses of tentacles, most often seen rolling in ravenous packs across Aucturn’s deserts. These bizarre creatures resemble tumbleweeds at a distance, but their fleshy, pulsating bodies covered in beady black eyes become more apparent up close. They move across land on tentacles that they also use to capture prey— even the slightest touch inflicts a supernatural swelling as carrion wheels can begin digesting their victims even before transferring the flesh into their toothy maws.<br/><br/> Carrion wheels earn their names for their unusual locomotion: rather than walking on their tentacles, which leaves them vulnerable to faster predators, they wind their tentacles into a wheel shape and roll across the terrain. Their meandering paths leave angry sores on Aucturn’s landscape, but traveling over rough terrain often tears them up, covering carrion wheels in blood and scars that hardly seem to bother the creatures. During Aucturn’s storms, carrion wheels roll with the winds, often gathering into groups of a hundred or more that barrel across the land. Where they find prey, they unravel and feast before embarking once more. For this reason, smaller settlements on Aucturn often include angled berms or concave walls that deflect incoming carrion wheels.<br/><br/> When not on the move, carrion wheels bury themselves so that only their tentacles remain aboveground, resembling desert brush. Unless starving (or if the winds blow just right), the creatures survive as ambush predators, snatching any suitable meals that approach within striking range of their hiding spots. Although fairly unintelligent, carrion wheels can capably mimic a variety of flora by posing, flattening, and wafting their tentacles.<br/><br/> Thanks to the creatures’ hostility (and Aucturn’s inhospitable conditions), studying carrion wheels poses a challenge. The greatest mystery pertains to their reproduction, as they’ve never been observed mating. In a few confirmed cases, injured carrion wheels have split apart and survived as separate organisms, yet on Aucturn this method seems an anomaly rather than the norm. Instead, the creatures somehow seed the landscape to trigger mass birthing events on Aucturn in which hundreds of fluid-filled pustules appear on the landscape overnight. Over the course of three days, these blisters balloon from apple-sized welts to throbbing, cow-sized cysts. On the fourth day, they burst in foul geysers, and each release an adolescent carrion wheel that swiftly whirls away in search of prey. In addition to releasing young aberrations, these ruptured boils leave behind strange tunnel networks, suggesting the carrion wheels might even originate belowground and only emerge above at a later life stage. However, the few attempts to explore these fetid tunnels have ended in tragedy. Instead, most explorers are content to listen at the tunnel entrances, from which messages in Aklo and unidentifiable languages periodically waft. These bizarre phenomena don’t hold for carrion wheels on other planets, where the creatures seem to reproduce only by fission. Carrion wheels prove most dangerous after they travel through the black, psychotropic ichor that runs through Aucturn’s throbbing veins. Rarely, one of the creatures develops a taste for the substance, after feeding on the ichor directly from the planet or feeding on an orocoran fat on the fluid. The ichor makes carrion wheels especially powerful, cunning, and aggressive. These so-called “ichor wheels” forgo burrowing for a more mobile lifestyle. As they feast, ichor wheels seem to enjoy collecting souvenirs (sometimes valuable treasures, but more often leftover bones and viscera) that they adhere to their bodies in a macabre expression of individuality. What they can’t carry, they arrange into artfully gruesome monuments.<br/><br/> Carrion wheels are native to Aucturn, but are occasionally found on other worlds. Rare specimens crop up on a variety of planets, thriving in colder, drier environments. It remains unclear how the creatures spread, though the leading theory proposes that biological matter from Aucturn can spontaneously develop into carrion wheels if visiting starships fail to properly sterilize. Any number of factors could contribute to their spread, which drives researchers to subdue and collect rogue carrion wheels across the galaxy in search of answers."
        }
    ],
    "game-obj": "Aliens",
    "stat_block": {
        "name": "Ichor Wheel",
        "type": "stat_block",
        "image": {
            "type": "image",
            "name": "Ichor Wheel",
            "game-obj": "Monster",
            "image": "AA4_Carrion_Wheel.png"
        },
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 8
        },
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Aberration",
            "alignment": "Neutral",
            "size": "Medium",
            "family": "Carrion Wheel",
            "cr": "14",
            "role": "Combatant",
            "xp": 38400
        },
        "senses": {
            "type": "stat_block_section",
            "subtype": "senses",
            "perception": {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 28
            },
            "special_senses": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "60 ft."
                        }
                    ],
                    "name": "darkvision"
                }
            ]
        },
        "defense": {
            "type": "stat_block_section",
            "subtype": "defense",
            "hp": {
                "type": "stat_block_section",
                "subtype": "hitpoints",
                "hp": 250
            },
            "ac": {
                "type": "stat_block_section",
                "subtype": "armor_class",
                "eac": 28,
                "kac": 30
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 16
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 16
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 14
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "reflexive rash"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "unflankable"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 15,
                    "name": "acid"
                }
            ]
        },
        "offense": {
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "50 ft.",
                        "movement_type": "walk",
                        "value": 50
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "tentacles",
                    "bonus": 27,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "4d6+20",
                            "damage_type": "Bludgeoning",
                            "damage_type_text": "B"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "inflame"
                        }
                    ]
                }
            ],
            "multiattack": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "multiattack",
                    "count": 4,
                    "name": "tentacles",
                    "bonus": 21,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "4d6+20",
                            "damage_type": "Bludgeoning",
                            "damage_type_text": "B"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "inflame"
                        }
                    ]
                }
            ],
            "space": "5 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "10 ft."
            },
            "offensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "offensive_ability",
                    "name": "ambush"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "offensive_ability",
                    "name": "inflame"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "offensive_ability",
                    "name": "nauseating display"
                }
            ]
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 6,
            "dex": 8,
            "con": 4,
            "int": -3,
            "wis": 0,
            "cha": -3,
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Acrobatics",
                        "value": 23
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 23
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Survival",
                        "value": 15
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Aklo",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "can’t speak"
                            }
                        ]
                    }
                ],
                "communication_abilities": [
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "limited telepathy"
                    }
                ]
            }
        },
        "ecology": {
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "any land",
            "organization": "solitary, pair, or plague (3–15)"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "A carrion wheel can adeptly ambush its prey while concealed. A carrion wheel that can act during a surprise round can take its full round of actions. It gains a +2 bonus to any attacks it makes during a surprise round.",
                "name": "Ambush",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "Toxic enzymes on the carrion wheel’s tentacles cause targets’ skin to erupt in painful rashes and excruciating, acid-filled boils. A creature hit by a carrion wheel’s tentacle attack is sickened for 1 round and develops boils (Fortitude DC 20 negates both effects). The next time the creature takes bludgeoning, piercing, or slashing damage, the boils explode violently, dealing 2d8 acid damage to the target (no save) and 8d8 acid damage to each creature within 5 feet of the target (Reflex DC 20 for half). If not ruptured, the boils fade naturally after 10 minutes, and they can be removed magically with lesser remove condition. This ability is a disease effect.",
                "name": "Inflame",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "As a swift action, the ichor wheel quickly expels and reabsorbs parts of its internal organs in an attempt to disgust observers. Creatures within 30 feet become sickened for 2d6 rounds (Will DC 20 negates). Once a creature has been exposed to an ichor wheel’s display, it can’t be affected by the same ichor wheel’s display for 24 hours. This is a sense-dependent effect.",
                "name": "Nauseating Display",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "A creature that briefly touches a carrion wheel (such as with an unarmed attack or most combat maneuvers) is exposed to the carrion wheel’s inflame ability (Reflex DC 20 negates). Actions that involve longer contact, such as grapple combat maneuvers, automatically expose the creature to the inflame ability with no Reflex save.",
                "name": "Reflexive Rash",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su"
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Alien Archive 4",
            "link": {
                "type": "link",
                "name": "Alien Archive 4 pg. 18",
                "alt": "Alien Archive 4 pg. 18",
                "href": "https://paizo.com/products/btq026jv?Starfinder-Alien-Archive-4"
            },
            "page": 18
        }
    ]
}