{
    "name": "Assembly Ooze",
    "type": "alien",
    "sections": [
        {
            "name": "Description",
            "type": "section",
            "html": "Thought to have been created on the planet Bretheda as a biotechnological replacement for automation processes, assembly oozes are essentially cores of nanobots suspended within blobs of animated protoplasm. As the ooze absorbs raw materials, the nanobots work at the molecular level to turn that matter into a functioning technological device, the blueprints of which have been entered into the machines’ original programming.<br/><br/> Due to sloppy programming procedures, the code embedded within an assembly ooze has an unfortunate tendency to easily become corrupted, causing the ooze to haphazardly deconstruct any nearby tech and use the pieces to build random items. The first time this occurred, several assembly oozes escaped the ensuing purge and built copies of themselves, eventually spreading to various shadowy corners of the galaxy. While these rogue oozes are not all that dangerous and have no innate malice, they are the bane of space stations, starships, weapon depots, and anywhere else technology is present. When discovered in such a location, assembly oozes are ruthlessly exterminated, lest their nonstop disassembling of all things mechanical and electronic destroy critical systems—to say nothing of the new, potentially lethal devices left in their wake. While assembly oozes are still used in some factories on Bretheda and its more toxic moons, their use is highly regulated.<br/><br/> An assembly ooze resembles a human-sized, silvery cube, though its amorphous form allows it to slip through incredibly small openings. As it moves, surging forward on its pseudopods, random scraps the ooze has already collected sometimes float near the creature’s surface before quickly disappearing into its form. Entirely focused on absorbing and reshaping any available technology, assembly oozes usually ignore organic matter, living or otherwise, unless threatened. However, should a creature have mechanical or cybernetic elements attached to or incorporated into its physical form, an assembly ooze could very well cause that creature incidental harm in its attempts to harvest the technological parts. Sentient robots are extremely wary of assembly oozes, as their entire bodies could be targeted for processing into raw resources.<br/><br/> Every so often, an assembly ooze holding its maximum number of virtual UPBs undergoes a form of mitosis, manufactures an identical copy of its computerized core, and splits its protoplasm into two equal parts. The nanobots of the two new assembly oozes then use the remaining virtual UPBs to build enough protoplasm to form an assembly ooze’s normal cube shape. This process usually takes about 1 hour and consumes all of the parent ooze’s virtual UPBs. That assembly oozes contain the programming necessary to reproduce is troubling to those who realize its implications: a single rogue assembly ooze introduced into an environment stocked with technological items could completely overrun such a place in a matter of days, leaving behind a wasteland of cheap laser pistols and smoke grenades that is inhabited only by the oozes—and any remaining organic beings unfortunate enough to be stranded in the area after their vessels are consumed.<br/><br/> In some cases, certain unscrupulous types have used assembly oozes as weapons. If slipped into a starship or military base, a manufactory of assembly oozes can easily cause enough chaos to allow an operative to sneak in and complete her mission with very little opposition. However, this is also highly risky to the would-be saboteur, as even one misplaced assembly ooze could render her escape vessel inoperative. Assembly oozes can be temporarily incapacitated by strong electrical fields and kept at bay by mystical force fields, but anyone restraining an assembly ooze must be constantly vigilant and stay out of reach of the ooze’s pseudopod.<br/><br/> A single assembly ooze can craft handheld objects, but some claim to have seen assembly oozes working together to construct entire starships and other large and complex machinery. Where these oozes received their programming is unknown, as is whether such oozes have a master directing their efforts or if they have gained a collective sentience and are working for their own mysterious purposes. Nevertheless, most engineers agree that, given enough raw material and enough time, there is no technological item a directed horde of assembly oozes couldn’t build, putting it together piece by piece.<br/><br/> An assembly ooze is a cube exactly 5 feet on each side that weighs 400 pounds."
        }
    ],
    "game-obj": "Aliens",
    "stat_block": {
        "name": "Assembly Ooze",
        "type": "stat_block",
        "image": {
            "type": "image",
            "name": "Assembly Ooze",
            "game-obj": "Monster",
            "image": "AA1_Assembly_Ooze.png"
        },
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 4
        },
        "creature_type": {
            "name": "creature_type",
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Ooze",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "technological"
                }
            ],
            "alignment": "Neutral",
            "size": "Medium",
            "cr": "1",
            "role": "Expert",
            "xp": 400
        },
        "senses": {
            "type": "stat_block_section",
            "subtype": "senses",
            "perception": {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 7
            },
            "special_senses": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "range": {
                        "type": "stat_block_section",
                        "subtype": "range",
                        "range": 60,
                        "text": "60 ft.",
                        "unit": "feet"
                    },
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "vibration"
                        }
                    ],
                    "name": "blindsight"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "name": "sightless"
                }
            ]
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "hp": {
                "name": "hitpoints",
                "type": "stat_block_section",
                "subtype": "hitpoints",
                "hp": 17
            },
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "eac": 11,
                "kac": 12
            },
            "saves": {
                "name": "Saves",
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 3
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": -1
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 2
                }
            },
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "ooze immunities"
                }
            ],
            "weaknesses": [
                {
                    "type": "stat_block_section",
                    "subtype": "weakness",
                    "name": "vulnerable to electricity"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "pseudopod",
                    "bonus": 6,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4+3",
                            "damage_type": "Bludgeoning",
                            "damage_type_text": "B"
                        }
                    ]
                }
            ],
            "space": "5 ft.",
            "reach": {
                "name": "Reach",
                "type": "stat_block_section",
                "subtype": "reach",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "10 ft. with pseudopod"
                    }
                ],
                "value": "5 ft."
            },
            "offensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "offensive_ability",
                    "name": "disassemble"
                }
            ]
        },
        "statistics": {
            "name": "Statistics",
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 2,
            "dex": 1,
            "con": 4,
            "int": null,
            "wis": 0,
            "cha": 0,
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "name": "Skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Athletics",
                        "value": 10
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 10
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "name": "Languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "can’t speak any language"
                    }
                ]
            },
            "other_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "other_ability",
                    "name": "assemble"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "other_ability",
                    "name": "compression"
                }
            ]
        },
        "ecology": {
            "name": "Ecology",
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "any urban",
            "organization": "solitary, pair, or manufactory (3-5)"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "In a process that takes 1 uninterrupted minute, an assembly ooze can craft a random piece of technological gear using its store of virtual UPBs (see disassemble below). An assembly ooze can craft a piece of technological gear of no more than 5 bulk with a cost equal to the number of virtual UPBs it spends, but with an item level no greater than its CR + 2 (3 for most assembly oozes). There is a 25% chance that a piece of gear an assembly ooze crafts has the broken condition. Roll 1d8 on the table below to determine what kind of gear the assembly ooze creates.<br/><br/><table class=\"inner\"> <tr> <td><b>D8</b></td> <td><b>Gear</b></td> </tr> <tr> <td>1</td> <td>Basic or advanced melee weapon</td> </tr> <tr> <td>2</td> <td>Small arm or longarm</td> </tr> <tr> <td>3</td> <td>Heavy weapon or sniper weapon</td> </tr> <tr> <td>4</td> <td>Grenade</td> </tr> <tr> <td>5</td> <td>Ammunition</td> </tr> <tr> <td>6</td> <td>Light or heavy armor</td> </tr> <tr> <td>7</td> <td>Armor upgrade</td> </tr> <tr> <td>8</td> <td>Technological item</td> </tr> </table>",
                "name": "Assemble",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "As a full action, an assembly ooze can engulf an unattended piece of technological gear of no more than 5 bulk and with an item level no greater than its CR + 2 (3 for most assembly oozes) within reach of its pseudopod. Unless the object succeeds at a DC 12 Fortitude saving throw, the ooze moves into that object’s space and deconstructs it into its component parts. The assembly ooze gains a number of virtual UPBs equal to the gear’s price in credits. An assembly ooze can hold a maximum number of virtual UPBs equal to 100 × its Constitution modifier (400 for most assembly oozes). In addition, if an assembly ooze succeeds at a grapple combat maneuver against a creature with the technological subtype, that creature takes 1d6+1 acid damage. The assembly ooze gains 1 virtual UPB for every point of damage it deals in this way.",
                "name": "Disassemble",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Alien Archive",
            "link": {
                "type": "link",
                "name": "Alien Archive pg. 16",
                "alt": "Alien Archive pg. 16",
                "href": "https://paizo.com/products/btpy9ujg"
            },
            "page": 16
        }
    ]
}