{
    "name": "Crest-Eater",
    "type": "alien",
    "sections": [
        {
            "name": "Description",
            "type": "section",
            "html": "Terrifying predators that roam the deserts and canyons of Kasath, crest-eaters earned their moniker thanks to their highly specialized diets: the hulking beasts feed almost exclusively on bone, and when attacking kasathas, they usually tear the humanoids’ heads from their bodies and then quickly and messily devour the bony crests within. A crest-eater has an advanced metabolism that processes the minerals it consumes to grow a large protrusion—a cross between antlers and a shell—from the crest-eater’s head and back. This outgrowth isn’t just made out of bone, however; it contains tiny fragments of reflective compounds that act like thousands of solar panels, thus providing the remainder of the nutrients the crest-eaters need to survive. As they age, the beasts grow more and more elaborate protrusions, increasing their surface area in order to store reserves of minerals for lean times. Crest-eaters also produce a venom that liquefies minerals, which can strip natural deposits of these resources from nearby rocks as easily as it melts the bones of their prey.<br/><br/> Crest-eaters have a muscular frame supported by four stout legs. The claws on a crest-eater’s legs are somewhat blunt, having evolved for scrabbling over rocks. A pair of thick limbs attached to the creature’s lower back area can function as another pair of legs, allowing it to easily navigate rocky terrain or distribute its bulk on shifting sands. However, the sharper claws on these extra appendages are mainly used for tearing through its prey’s flesh to reach the bones. A crest-eater’s vicious teeth are capable of delivering painful bites and injecting its devastating venom. Despite its rather reptilian appearance, the crest-eater shares many similarities to mammals, including a steady body temperature and the ability to bear live young.<br/><br/> Just as their biology skirts the edge of reptilian standards, so too does crest-eaters’ behavior. They are exceptionally social and loving animals, forming small prides of unrelated adults to hunt prey, dig out mineral deposits, and guard one another while they sleep. Many bold young hunters have fallen after slaying a single crest-eater, only to find its halfdozen compatriots rising from the sand around them. Cresteaters give birth to one or two young after a long pregnancy, during which the female grows increasingly ravenous for flesh and water, and an entire pride may take to hunting and aggressively defending water sources to feed a single pregnant mother’s needs. Newborn crest-eaters can dissolve bones immediately, though they are cautious predators until they begin to grow their first antler-shell around 1 year later.<br/><br/> Crest-eaters that grow up in close proximity to other creatures often form close bonds with them, and thus they can be found traveling with small crowds of scavengers that pick parasites off their protrusions and snatch up any kills the mighty hunters leave behind. Despite the creatures’ social nature, especially large males become increasingly aggressive as they age and are often driven from their prides and the most reliable sources of food. Though a bit past their prime, these crest-eaters are still very dangerous, and they usually become unpredictable loners that attack desert communities without fear. It sometimes takes the collective effort of several heroes to either put down or drive off one of these wild beasts. Such an endeavor is rarely accomplished without casualties or major injuries.<br/><br/> Crest-eaters occupy a place of fear and reverence in distant kasathan history. The humanoids’ ancient ancestors saw the beasts as terrifying messengers of death, particularly because of their tendency to rip off a victim’s head and leave the remainder of the body unmolested. Today, the crest-eater is still feared but better understood, and kasathan scientists have extensively studied the unique crystals the beasts grow. These are now the foundation for kasathan solar technology. After millennia of kasathan contact with the wider galaxy, crest-eaters have spread to other worlds, both due to kasathan technology sometimes relying on the creatures’ power-generating capabilities and as a result of other races employing crest-eaters as guard beasts, trophies to hunt, or exotic pets. The Idari even brought crest-eaters along on its long voyage, though these are kept carefully contained; rumors of escaped and feral crest-eaters living in the ship’s ventilation shafts are assumed to be spurious.<br/><br/> A typical crest-eater is 14 feet from head to tail and is 6 feet tall at the shoulder, though this doesn’t count its elaborate protrusions. An average crest-eater weighs more than 1,000 pounds."
        }
    ],
    "game-obj": "Aliens",
    "stat_block": {
        "name": "Crest-Eater",
        "type": "stat_block",
        "image": {
            "type": "image",
            "name": "Crest-Eater",
            "game-obj": "Monster",
            "image": "AA1_Crest-Eater.png"
        },
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 1
        },
        "creature_type": {
            "name": "creature_type",
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Magical Beast",
            "alignment": "Neutral",
            "size": "Large",
            "cr": "4",
            "role": "Combatant",
            "xp": 1200
        },
        "senses": {
            "name": "Senses",
            "type": "stat_block_section",
            "subtype": "senses",
            "perception": {
                "name": "Perception",
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 10
            },
            "special_senses": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "name": "Special Sense",
                    "value": "bone tracker"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "name": "Special Sense",
                    "range": {
                        "type": "stat_block_section",
                        "subtype": "range",
                        "text": "darkvision 60 ft.",
                        "range": 60,
                        "unit": "feet"
                    },
                    "value": "darkvision"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "name": "Special Sense",
                    "value": "low-light vision"
                }
            ]
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "hp": {
                "name": "hitpoints",
                "type": "stat_block_section",
                "subtype": "hitpoints",
                "hp": 54
            },
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "eac": 16,
                "kac": 19
            },
            "saves": {
                "name": "Saves",
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 8
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 8
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 3
                }
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "60 ft.",
                        "movement_type": "walk",
                        "value": 60
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "bite",
                    "bonus": 13,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d6+7",
                            "damage_type": "Piercing",
                            "damage_type_text": "P"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "1 Con"
                        }
                    ]
                }
            ],
            "ranged": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "ranged",
                    "name": "venom spit",
                    "bonus": 10,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "1 Con"
                        }
                    ]
                }
            ],
            "space": "10 ft.",
            "reach": {
                "name": "Reach",
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "10 ft."
            },
            "offensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "offensive_ability",
                    "text": "bone eater"
                }
            ]
        },
        "statistics": {
            "name": "Statistics",
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 3,
            "dex": 1,
            "con": 3,
            "int": -2,
            "wis": 1,
            "cha": -1,
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "name": "Skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 15
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Survival",
                        "value": 10
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "name": "Languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Kasatha"
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "can’t speak any language"
                    }
                ]
            }
        },
        "ecology": {
            "name": "Ecology",
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "warm deserts (Kasath)",
            "organization": "solitary, pair, or pride (3-6)"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "A crest-eater’s bite delivers a magical venom that dissolves certain minerals in its victim’s body, liquefying that creature’s bones. Each bite attack that deals damage also deals 1 Constitution damage. A target can negate this damage with a successful DC 13 Fortitude save.",
                "name": "Bone Eater",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "A crest-eater’s sense of smell is keenly attuned to the minerals it needs to survive. It can sniff out natural deposits of calcium, and it gains blindsense (scent) against creatures that have taken Constitution damage from its attacks in the past hour.",
                "name": "Bone Tracker",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "As a standard action, a crest-eater can make a ranged attack against the KAC of a single target within 30 feet, spitting its bone-liquefying venom. If struck, the target must succeed at a DC 13 Fortitude save or take 1 Constitution damage.",
                "name": "Venom Spit",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su"
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Alien Archive",
            "link": {
                "type": "link",
                "name": "Alien Archive pg. 30",
                "alt": "Alien Archive pg. 30",
                "href": "https://paizo.com/products/btpy9ujg"
            },
            "page": 30
        }
    ]
}