{
    "name": "Electrovore",
    "type": "alien",
    "sections": [
        {
            "name": "Description",
            "type": "section",
            "html": "Native to the wild planet of Verlorr, electrovores were on the verge of extinction as increased volcanic activity led to their swampy habitat’s disappearance, and along with it the three-headed electric eels that provided them sustenance. When explorers from the Pact Worlds first arrived on Verlorr 2 decades ago, however, electrovores were given a new lease on life, as the travelers came on massive metal vessels coursing with the very nourishment the beasts sought. A few crept on board the various ships, and since then, “conduit rats” (as some spacefarers refer to them) have quickly multiplied, forming colonies of varying sizes everywhere from Absalom Station to the farthest reaches of the Vast.<br/><br/> An electrovore gains sustenance not from ingesting biological material but from the electrical currents that pulse through both mechanical devices and organic creatures. Xenobiologists have shown evidence that an electrovore’s internal organs are unlike those of a normal animal—it has no stomach, no intestines, and no liver. Instead, every cell of the creature acts as a tiny battery, providing the necessary impulses to move its muscles and power brain functions. In essence, an electrovore is composed almost entirely of nervous system. The creatures have quickly adapted to the artificial habitats of starships and space stations that course with their nourishment.<br/><br/> With a serpentine body covered in sparking spines and sprouting a pair of leathery wings, a typical electrovore is 3 feet long and weighs 25 pounds. An electrovore has three bright-blue visual sensors: two flanking its head and one situated on the bridge of its snout. Its wide mouth is full of sharp teeth, but it rarely uses them in combat, instead employing them to chew through wire casings. An electrovore prefers to slap and sting with its barbed tail when on the hunt.<br/><br/> A single electrovore poses little immediate threat to a starship or space station, but two or more reproduce at an alarming rate and can quickly overrun even the most experienced and best-equipped engineering team. The first signs of an electrovore infestation are usually power fluctuations in a remote, rarely traveled portion of a ship or decks already under repair or construction, but such deviations can be the result of anything from cosmic rays to a loose coupling or power being diverted to other systems. A gnawed cable or severed connector is generally the next indication of an electrovore’s presence, but by then there are likely dozens and dozens of the creatures throughout the ship’s crawlways, in its walls, and beneath its floors out of sight.<br/><br/> In their new habitats, electrovores are incredibly fecund, doubling in number in 1d6+5 weeks (assuming there are two or more to begin with). If left unchecked, a handful of the creatures on a space station or large ship can eventually overwhelm the crew’s capacity to deal with them. As such, malicious space pirates and saboteurs sometimes release a pair of electrovores into a closed environment to disable their enemies’ vessels, distract from other threats or operations, or sink the economic or resale value of commercial operations or salvaged ships. However, the electrovores just as often disable the ships of these pirates and saboteurs, making this a risky and unreliable tactic.<br/><br/> In addition to the direct damage an electrovore colony can deal to a ship’s infrastructure, it can also wreak havoc on the vessel’s systems when threatened. Full of siphoned electrical energy, a startled or cornered electrovore discharges this stored potential, often resulting in even more damage to computer systems and organic matter than the creature could normally manage in twice the time. Luckily, it takes some time for an electrovore to gather enough energy to perform this devastating attack.<br/><br/> Larger starships generally have enough redundancies built into their construction that it takes much longer for electrovore infestations to disable their key systems, though a sizable enough colony of the creatures can unleash incredible destruction in a surprisingly short amount of time in the right conditions. Even a starship with one electrovore on it is in danger of eventually being incapacitated. For each period of time for each size of starship listed in the table below, one of the vessel’s systems (determined randomly) takes critical damage (<i>Starfinder Core Rulebook</i> 321). Of course, the more electrovores infesting a vessel, the faster they disable its systems, though it takes a minimum of 1 day for a starship to take a critical damage effect in this way.<br/><br/><table class=\"inner\"> <tr> <td><b>Starship Size</b></td> <td><b>Time</b></td> </tr> <tr> <td>Tiny</td> <td>1d6 days – 1 day/2 electrovores</td> </tr> <tr> <td>Small</td> <td>2d6 days – 1 day/3 electrovores</td> </tr> <tr> <td>Medium</td> <td>2d10 days – 1 day/6 electrovores</td> </tr> <tr> <td>Large</td> <td>4d8 days – 1 day/12 electrovores</td> </tr> <tr> <td>Huge</td> <td>6d10 days – 1 day/30 electrovores</td> </tr> <tr> <td>Gargantuan</td> <td>3d12 weeks – 1 week/50 electrovores</td> </tr> <tr> <td>Colossal</td> <td>4d6 months – 1 month/100 electrovores</td> </tr> </table>"
        }
    ],
    "game-obj": "Aliens",
    "stat_block": {
        "name": "Electrovore",
        "type": "stat_block",
        "cr": "2",
        "role": "Expert",
        "xp": 600,
        "initiative": {
            "name": "Initiative",
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 4
        },
        "alignment": "Neutral",
        "size": "Small",
        "creature_type": {
            "name": "creature_type",
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Magical Beast"
        },
        "perception": {
            "name": "Perception",
            "type": "stat_block_section",
            "subtype": "perception",
            "value": 12
        },
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "low-light vision"
            }
        ],
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "hp": 23,
            "rp": 3,
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "eac": 14,
                "kac": 14
            },
            "saves": {
                "name": "Saves",
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 3
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 7
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 1
                }
            },
            "immunities": [
                "electricity"
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "ability_type": "Extraordinary",
                        "ability_type_abbrev": "Ex",
                        "maneuverability": "average",
                        "name": "fly 30 ft.",
                        "movement_type": "fly",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "tail slap",
                    "bonus": 9,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4+3",
                            "damage_type": "Bludgeoning",
                            "damage_type_text": "B"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "critical": true,
                            "effect": "siphon"
                        }
                    ]
                }
            ],
            "offensive_abilities": [
                {
                    "name": "Offensive Ability",
                    "type": "stat_block_section",
                    "subtype": "offensive_ability",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "1d6+2 E plus staggered"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "Reflex DC 13 half"
                        }
                    ],
                    "value": "electrical discharge"
                }
            ]
        },
        "statistics": {
            "name": "Statistics",
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 1,
            "dex": 4,
            "con": 1,
            "int": -4,
            "wis": 2,
            "cha": -1,
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "name": "Skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Acrobatics",
                        "value": 7
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Athletics",
                        "value": 7
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 12
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Survival",
                        "value": 12
                    }
                ]
            }
        },
        "ecology": {
            "name": "Ecology",
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "any",
            "organization": "solitary, pair, nest (3–12), or colony (13+)"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "As a standard action, an electrovore can spend 1 Resolve Point to discharge some of its stored electrical energy as a powerful attack. All creatures within 10 feet of the electrovore take 1d6+2 electricity damage and are staggered for 1 round. A target can attempt a DC 13 Reflex save to take half this damage and negate the staggered effect.",
                "name": "Electrical Discharge",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "Whenever an electrovore scores a critical hit against a living creature, a construct with the technological subtype, or a technological piece of gear, it siphons off a portion of the target’s electrical energy. This restores 1 Resolve Point (up to its maximum of 3).",
                "name": "Siphon",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Alien Archive",
            "link": {
                "type": "link",
                "name": "Alien Archive pg. 44",
                "alt": "Alien Archive pg. 44",
                "href": "https://paizo.com/products/btpy9ujg"
            },
            "page": 44
        }
    ]
}