{
    "name": "Hallajin",
    "type": "alien",
    "sections": [
        {
            "name": "Description",
            "type": "section",
            "html": "Spacefaring legends from ancient times describe the “lights of Hallas,” strange glowing forms seen on the moon Hallas beneath the stormy shadow of Liavara the Dreamer. Most of the time, these shapes look like shifting multicolored masses of light, though sometimes hints of feathery wings, scaly coils, staring eyes, or writhing tendrils emerge from within their depths. These forms were initially believed to be just strange lights seen in the sky of Hallas, perhaps an aurora or a type of ball lightning related to the storms of Liavara, but visitors to the moon quickly learned they were intelligent—if inscrutable—creatures, though that knowledge came at a high price. The creatures are able to communicate telepathically, but when the first emissaries from nearby Arkanen attempted to contact them in the same manner, the experience seared the emissaries’ minds. This led to the establishment of a powerful magical cordon around the world—one that remains in place to this day, now administrated by Pact Worlds officials on nearby Arkanen to ensure unprepared visitors don’t accidentally destroy their minds or anger the powerful entities.<br/><br/> Study of ancient ruins and artifacts on Hallas by modern archaeological and paleobiological teams has contributed to the belief that the so-called hallajins (their name for themselves is unknown) once had material forms but developed beyond the need for them and became beings of pure energy. Examination of the surviving art and artifacts on Hallas suggests hallajins considered their small world the center of the universe, with other worlds and stars revolving around it, and saw the idea of leaving it as heresy. This may explain why hallajins are rarely seen away from Hallas. Though actual answers are few, historians believe that those occasional hallajins sighted on other worlds may be descendants of an ancient schism in their society that happened before the Gap or the establishment of the protective cordon.<br/><br/> Hallajins can use their light leap ability to appear and vanish at will, fly swiftly, pass through material barriers, and cross vast distances in the blink of an eye. Early adepts of Arkanen discovered that hallajins either will not or cannot pass through intense electrical fields, and they found that electricity appears to cause hallajins pain— or at least that they recoil from it. Researchers theorize that electricity interferes in some way with the creatures’ energy matrices. This weakness provides a means of shielding against hallajin intrusions, although intense electrical energy fields also appear to draw the creatures’ attention, perhaps being especially visible to their senses. Large concentrations of minds, particularly emotional ones, seem to likewise draw the creatures, and researchers must keep their minds carefully shielded with specialized armor or magical protections.<br/><br/> What hallajins want, if anything, is unclear. The little of their culture recovered from ancient ruins and brief interactions indicates that their advancement to their current form was part of an intentional cultural drive to attempt to reach collective godhood. Whether the creatures intentionally stopped at their current state or simply couldn’t progress any further remains unknown. Today, hallajins appear capricious and intensely curious, and their behavior is unpredictable. They are almost always encountered singly, although small groups of them have been sighted in the distance on Hallas. Yet despite their apparently solitary behavior, they remain in near-constant communication with others of their kind across vast distances. They don’t appear to understand or respond to any known spoken languages, and attempts to contact them telepathically usually end in disaster. The hallajins sometimes initiate contact, telepathically “speaking” in an unsettling chorus of voices to their listeners, but rarely say anything intelligible. Hallajins occasionally follow visitors to their home planets, exercising their telekinetic abilities to shift objects around or cause random poltergeistlike phenomena, sometimes dangerously. In a few cases, the energy beings turn suddenly hostile, attacking with bursts of searing energy or overloading victims’ minds. Interestingly, hallajins appear incapable of recognizing mechanical constructs as anything but objects, even if such creatures are intelligent.<br/><br/> The unexplained behavior, strange powers, and eerie appearance of hallajins lead some intelligent creatures to revere them as examples of universal forces or enlightened beings. A few visiting scholars have started single-minded cults around the creatures, believing that hallajins hold the secrets to assisting corporeal beings in attaining a similarly evolved state, if only they can be persuaded to share them. Some think this is accomplished by attracting the attention of the lights of Hallas, and then communing and proving their worthiness in some fashion, while others think they can trick or even force the secret from hallajins. Hallajin cults tend to be obsessed with ancient artifacts from Hallas and strange electrical mechanisms designed to summon, communicate with, or even trap the objects of their worship. Though many fear the consequences of allowing such groups contact with the creatures, so far the Pact Worlds overseers have continued to grant these fanatics unrestricted access to Hallas.<br/><br/> Due to their aberrant anatomy, it is incredibly difficult to determine the average size of a hallajin. Most scientists posit that they range from 14 to 20 feet in length and, as beings of energy, weigh next to nothing."
        }
    ],
    "game-obj": "Aliens",
    "stat_block": {
        "name": "Hallajin",
        "type": "stat_block",
        "image": {
            "type": "image",
            "name": "Hallajin",
            "game-obj": "Monster",
            "image": "AA1_Hallajin.png"
        },
        "initiative": {
            "name": "Initiative",
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 5
        },
        "creature_type": {
            "name": "creature_type",
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Aberration",
            "alignment": "Chaotic Neutral",
            "size": "Large",
            "cr": "17",
            "role": "Spellcaster",
            "xp": 102400
        },
        "senses": {
            "name": "Senses",
            "type": "stat_block_section",
            "subtype": "senses",
            "perception": {
                "name": "Perception",
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 29
            },
            "special_senses": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "name": "Special Sense",
                    "range": 120,
                    "range_unit": "ft.",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "thought"
                        }
                    ],
                    "value": "blindsight"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "name": "Special Sense",
                    "range": 60,
                    "range_unit": "ft.",
                    "value": "darkvision"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "name": "Special Sense",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "thought"
                        }
                    ],
                    "value": "sense through"
                }
            ]
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "hp": {
                "name": "hitpoints",
                "type": "stat_block_section",
                "subtype": "hitpoints",
                "hp": 280
            },
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "eac": 31,
                "kac": 30
            },
            "saves": {
                "name": "Saves",
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 15
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 15
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 22
                }
            },
            "defensive_abilities": [
                {
                    "name": "Defensive Ability",
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "text": "incorporeal"
                },
                {
                    "name": "Defensive Ability",
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "text": "searing mind"
                }
            ],
            "immunities": [
                {
                    "name": "Immunity",
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "text": "advanced immunities"
                }
            ],
            "sr": {
                "name": "SR",
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 28
            },
            "weaknesses": [
                "vulnerable to electricity"
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "ability_type": "Extraordinary",
                        "ability_type_abbrev": "Ex",
                        "maneuverability": "perfect",
                        "name": "fly 120 ft.",
                        "movement_type": "fly",
                        "value": 120
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "energy surge",
                    "bonus": 25,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "8d6+17",
                            "damage_type": "Fire",
                            "damage_type_text": "F"
                        }
                    ]
                }
            ],
            "ranged": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "ranged",
                    "name": "energy surge",
                    "bonus": 27,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "4d8+17",
                            "damage_type": "Fire",
                            "damage_type_text": "F"
                        }
                    ]
                }
            ],
            "space": "10 ft.",
            "reach": {
                "name": "Reach",
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "10 ft."
            }
        },
        "statistics": {
            "name": "Statistics",
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": null,
            "dex": 5,
            "con": 8,
            "int": 11,
            "wis": 8,
            "cha": 5,
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "name": "Skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Culture",
                        "value": 34
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Mysticism",
                        "value": 34
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "name": "Languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Hallas"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "telepathy 120 ft. and telepathy"
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "anywhere on same plane"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "other hallajins only"
                    }
                ]
            },
            "other_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "other_ability",
                    "name": "Other Ability",
                    "text": "light leap"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "other_ability",
                    "name": "Other Ability",
                    "text": "shining"
                }
            ]
        },
        "ecology": {
            "name": "Ecology",
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "any",
            "organization": "solitary"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "Hallajins are immune to bleed, disease, mind-affecting effects, paralysis, poison, sleep, and stunning. They are also immune to ability damage, ability drain, exhaustion, fatigue, negative levels, and nonlethal damage.",
                "name": "Advanced Immunities",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "A hallajin can concentrate its glowing form into deadly flaming energy to make either melee or ranged attacks. Its ranged energy surge attack has a range increment of 100 feet.",
                "name": "Energy Surge",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "As a full action, a hallajin can teleport (as per <i>teleport</i>), except it can’t leave or enter an area enclosed by barriers of electrical energy.",
                "name": "Light Leap",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "The mind and spirit of a hallajin is so convoluted and energetic that direct contact with it via abilities like <i>detect thoughts</i>, <i>mind link</i>, or other spells or abilities that charm or dominate causes feedback of psychic energy. The creature contacting the hallajin’s mind takes 4d8+8 psychic damage (Will DC 24 half). This damage occurs each round a creature remains in contact with the hallajin’s mind. A hallajin using its telepathy on a creature doesn’t affect it in this way.",
                "name": "Searing Mind",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "A hallajin sheds light as per a beacon.",
                "name": "Shining Form",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Alien Archive",
            "link": {
                "type": "link",
                "name": "Alien Archive pg. 60",
                "alt": "Alien Archive pg. 60",
                "href": "https://paizo.com/products/btpy9ujg"
            },
            "page": 60
        }
    ]
}