{
    "name": "Patrol-Class Security Robot",
    "type": "alien",
    "sections": [
        {
            "name": "Robot (Security)",
            "type": "section",
            "sources": [
                {
                    "type": "source",
                    "name": "Alien Archive",
                    "link": {
                        "type": "link",
                        "name": "Alien Archive pg. 94",
                        "alt": "Alien Archive pg. 94",
                        "href": "https://paizo.com/products/btpy9ujg"
                    },
                    "page": 94
                }
            ],
            "html": "Security robots come in a wide variety of makes and models, with a near-endless variety of customizations based on both the manufacturer and the aesthetics and needs of the consumer. Crafted with advanced user interfaces mimicking moderate intelligence, but without any of the emotions, unpredictability, or bias of a true AI or sentient creature, security bots are an eminently practical, reasonable solution to a wide variety of security needs. Unlike full-on military models, security robots usually come preprogrammed with certain fail-safes preventing them from engaging in violence beyond what’s necessary for the protection of their assigned population or property, making them a go-to option for police forces, corporations, and even wealthy individuals looking for peace of mind.<br/><br/> One of the cheapest and most common types of security robot is the observer. Observer-class bots are usually small, flying robots designed primarily to record and report specific unsavory activities for later review by their owners, though they are also equipped to fend off minor threats. Whether buzzing through the access ducts of secure facilities or hovering over crowded marketplaces, observers are nearly ubiquitous in some advanced settlements. On Absalom Station, the most prominent brand is AbadarCorp’s VizAll, a flying orb with gentle contours designed to put citizens at ease, with a central eye, stubby fins, and relentlessly cheerful speech patterns. Aballon’s Sunward Corporation produces the more disconcerting Arbitron, whose insectile form mimics those of the resident anacites, while Triaxus’s Bluescale Industries crafts theirs to resemble tiny, mechanical drakes. Regardless of their shape, however, observers are known for their convenience, but they are infamous for their limited nuance—a problem for owners who forget their own security passphrase. Some of the cheapest models also have faulty programming that causes them to develop personality quirks, making a particular bot act especially aggressive, friendly, or even dejected.<br/><br/> Patrol-class security robots are more humanoid in shape, standing about 6 feet tall with integrated armaments that keep the robots’ limbs free to apprehend offenders and engage in close combat. Given their deadlier weaponry and tougher armor plating, patrol-class security robots (sometimes simply called “patrol bots”) are more regulated in their sale and use. They are found mostly in large space stations and corporate facilities under government or syndicate control. As with observer-class robots, these models run the gamut from four-armed Idaran Peacekeepers to the artistic Castrovelian Linewalkers that guard against dangerous jungle beasts, yet the overwhelming industry leader is AbadarCorp’s Town Guard series. With blank, circular faces of glass or glowing energy and cleanly contoured limbs capable of folding up for easy storage, AbadarCorp’s patrol bot is a triumph of industrial design and defense. This model’s reputation has been further boosted due to the fact that it’s the only model of patrol bot currently used by Absalom Station’s government, with many going straight into service from the corporation’s manufactories in the Spike.<br/><br/> Unfortunately, not all security bots end up working for law-abiding corporations or state governments. Various planets in the Pact Worlds system have their own rules about who is or is not licensed to own a security robot, and the Pact Worlds government generally finds it easier to look the other way than to get embroiled in the contentious issues of rights-to- weapons and planetary sovereignty. As a result, it’s not difficult for individuals to purchase security robots entirely unregulated on the black market, albeit at a high cost. In cases where a world outlaws such sales, these models are usually formerly legal models that have been stolen and cracked by hacker gangs, while in other places corporations quietly sell to known criminal enterprises without asking questions. Such security robots are sometimes marked by their owners to show their “allegiance”—they might be painted with gang symbols or have their heads replaced with disturbing mannequin busts. Other groups maintain their robots’ official appearances, the better to carry out kidnappings and extortion. Because of this, passersby occasionally stumble across pitched firefights between squads of similar-looking security robots. Those who wish to get involved must be careful to identify each side’s master, as they could find themselves unintentionally taking sides in a gang war.<br/><br/> Though both observer and patrol models have safeguards to protect against it, glitches can occasionally develop in a security robot’s firmware, often the result of massive damage sustained during a firefight or improper diagnostics after such an altercation. In such cases, the glitch can override the bot’s usual baselevel programming regarding tiers of force and the logic of conflict escalation, or even its protocol to protect the innocent. This can result in a bloody rampage, with the robot either going berserk over perceived violation of nonexistent laws, or technically following the law but executing lethal punishment for even the smallest infraction. Even worse, an infected patrol bot’s nanites can carry its corrupted code like a virus, turning other security robots rogue. When this occurs, manufacturers like AbadarCorp are usually quick to hire discreet “contractors” to deal with the menace (as maintaining their own strike-and-disassembly force would publicly acknowledge the threat)."
        }
    ],
    "game-obj": "Aliens",
    "stat_block": {
        "name": "Patrol-Class Security Robot",
        "type": "stat_block",
        "image": {
            "type": "image",
            "name": "Patrol-Class Security Robot",
            "game-obj": "Monster",
            "image": "AA1_Robot_Security_Patrol.png"
        },
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 5
        },
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Construct",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "technological"
                }
            ],
            "alignment": "Neutral",
            "size": "Medium",
            "family": "Robot (Security)",
            "cr": "4",
            "role": "Combatant",
            "xp": 1200
        },
        "senses": {
            "type": "stat_block_section",
            "subtype": "senses",
            "perception": {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 10
            },
            "special_senses": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "range": {
                        "type": "stat_block_section",
                        "subtype": "range",
                        "range": 60,
                        "text": "60 ft.",
                        "unit": "feet"
                    },
                    "name": "darkvision"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "name": "low-light vision"
                }
            ]
        },
        "defense": {
            "type": "stat_block_section",
            "subtype": "defense",
            "hp": {
                "type": "stat_block_section",
                "subtype": "hitpoints",
                "hp": 52
            },
            "ac": {
                "type": "stat_block_section",
                "subtype": "armor_class",
                "eac": 16,
                "kac": 18
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 4
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 4
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 1
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "integrated weapons"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "nanite repair"
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "construct immunities"
                }
            ],
            "weaknesses": [
                {
                    "type": "stat_block_section",
                    "subtype": "weakness",
                    "name": "vulnerable to critical hits"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "weakness",
                    "name": "vulnerable to electricity"
                }
            ]
        },
        "offense": {
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "slam",
                    "bonus": 10,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d6+7",
                            "damage_type": "Bludgeoning",
                            "damage_type_text": "B"
                        }
                    ]
                }
            ],
            "ranged": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "ranged",
                    "name": "integrated tactical arc emitter",
                    "bonus": 13,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4+4",
                            "damage_type": "Electricity",
                            "damage_type_text": "E"
                        }
                    ]
                }
            ],
            "offensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "offensive_ability",
                    "name": "jolting arc"
                }
            ]
        },
        "gear": [
            {
                "type": "stat_block_section",
                "subtype": "item",
                "name": "tactical arc emitter",
                "with": {
                    "type": "stat_block_section",
                    "subtype": "item",
                    "name": "batteries",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "20 charges each"
                        }
                    ],
                    "quantity": 2
                }
            }
        ],
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 3,
            "dex": 5,
            "con": null,
            "int": 1,
            "wis": 0,
            "cha": 0,
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Acrobatics",
                        "value": 10
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Computers",
                        "value": 10
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Intimidate",
                        "value": 15
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    }
                ]
            },
            "other_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "other_ability",
                    "name": "unliving"
                }
            ]
        },
        "ecology": {
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "any urban",
            "organization": "solitary, pair, or patrol (3–7)"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "A security robot’s weapons are integrated into its frame and can’t be disarmed.",
                "name": "Integrated Weapons",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "Once every 1d4 rounds as a standard action, a patrol-class security robot can shoot an arc of electricity at up to four creatures within 40 feet (no two of which can be more than 30 feet apart). This arc deals 1d8 electricity damage to each target (Reflex DC 13 half).",
                "name": "Jolting Arc",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "A patrol-class security robot’s nanites heal it, restoring a number of Hit Points per hour equal to its CR (4 Hit Points per hour for most security robots). Once per day as a full action, a patrol-class security robot can restore 3d8 Hit Points to itself or any touched construct with the technological subtype.",
                "name": "Nanite Repair",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Alien Archive",
            "link": {
                "type": "link",
                "name": "Alien Archive pg. 94",
                "alt": "Alien Archive pg. 94",
                "href": "https://paizo.com/products/btpy9ujg"
            },
            "page": 94
        }
    ]
}