{
    "name": "Drift Architech",
    "type": "alien",
    "sections": [
        {
            "name": "Drift Native",
            "type": "section",
            "sources": [
                {
                    "type": "source",
                    "name": "Alien Archive 3",
                    "link": {
                        "type": "link",
                        "name": "Alien Archive 3 pg. 24",
                        "alt": "Alien Archive 3 pg. 24",
                        "href": "https://paizo.com/products/btq01wt9?Starfinder-Alien-Archive-3"
                    },
                    "page": 24
                }
            ],
            "html": "The hyperspace plane of the Drift is effectively infinite, and so too is the variety of creatures it contains. While some residents are inadvertently pulled into the Drift from their native planes, many more are truly unique products of the Drift itself. Some of the better known examples include driftdead, paraforans, and the rare and powerful spectra. Whether these creatures were created by Triune or came about from the unnatural mingling of technological and planar forces is commonly debated among xenobiologists. The constant accretion of other planes and their inhabitants into the Drift makes determining any unidentified species’ origin difficult, and though time generally flows in a linear fashion in the Drift, some pockets contain planar fragments or gravitational anomalies that cause time dilation or compression. In such places, it’s entirely possible for a species to undergo significant evolution in a relatively short time.<br/><br/> Of the better-known Drift natives, the time eater is simultaneously one of the most benign yet terrifying. Time eaters resemble strange neurons at a macro scale, with roughly spherical crystalline bodies bristling with translucent, flexible tentacles that stretch out far past the time eater’s body. Typically these tentacles are entangled with those of other time eaters, forming large, weblike clusters. Due to their transparency, such webs are extremely difficult to detect as they coast through the Drift. On their own, time eaters have limited mobility. However, when they make contact with animate creatures and constructs, they can unleash devastating tentacle attacks that seem to arrest the timelines of their victims while speeding up their own. Consequently, time eaters spend a majority of their indeterminate life spans gliding through the hyperspace plane in hopes of encountering creatures from which they can steal time. As creatures native to a plane with a relatively normal passage of time, time eaters have an unusual relationship with temporality. This has lead scholars to speculate that the creatures were born from some strange interaction when pockets of the Dimension of Time were pulled into the Drift—but that realm is so poorly understood that even this explanation provides few clues.<br/><br/> Massive colonies of time eaters, known as “ganglions,” are the stuff of nightmare and legend, and starship crews swap haunting stories about moon-sized webs of time eaters descending on a planet and freezing it in time, though no such event has been recorded. Even more harrowing tales revolve around a single time eater stowing away on a ship, trapping its crew an endless, timeless moment with no hope of escape. From the few surviving records of interactions with time eaters, it seems they use the energy drained from their victims to propagate more copies of themselves, either extending their own web or sending out spores to start a new web elsewhere.<br/><br/> As time eaters upend the natural progression of time in pockets of the Drift, so do Drift architects manipulate the plane’s spatial dimensions. For these amorphous, gaseous creatures, concepts of position and distance are as malleable as clay in the hands of a master sculptor. These native Drift denizens have the ability to deconstruct foreign material, such as that constantly pulled into the plane by the activation of Drift engines, and knit those realities into the fundamental essence of the plane. On more than one occasion, a drift architect has classified living creatures, constructs, and even starships from the Material Plane as appropriate material for translation, leading to sudden and desperate conflict. Drift architects are also able to travel to any part of the Drift almost instantaneously, making them one of few known creatures able to deftly navigate the ever-shifting plane without any external guidance.<br/><br/> A small number of drift architects are constantly at work at the edges of Alluvion, the spiritual home of Triune and epicenter of the Drift, helping incorporate new material into the ever-growing city. While at work processing planar material, Drift architects adopt a more compact form that resembles a geometric pattern of interlocked rings reminiscent of Triune’s holy symbol.<br/><br/> If Drift architects have a broader agenda, it is as yet unknown, as almost no known method of communication has proven successful in opening a dialogue with the creatures. They mostly ignore visitors to the Drift unless attacked or provoked, and even then they often flee rather than engage in combat. Only followers of Triune have reported any success at communicating with them, and even then, only if they’re on a mission of importance to Triune or their church. In those rare situations, drift architects can prove to be potent allies, transporting a small group of travelers to nearly any point in the Drift almost instantaneously."
        }
    ],
    "game-obj": "Aliens",
    "stat_block": {
        "name": "Drift Architech",
        "type": "stat_block",
        "image": {
            "type": "image",
            "name": "Drift Architech",
            "game-obj": "Monster",
            "image": "AA3_Drift_Native_Architect.png"
        },
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 8
        },
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Outsider",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "extraplanar"
                }
            ],
            "alignment": "Neutral",
            "size": "Large",
            "family": "Drift Native",
            "cr": "10",
            "role": "Expert",
            "xp": 9600
        },
        "senses": {
            "type": "stat_block_section",
            "subtype": "senses",
            "perception": {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 19
            },
            "special_senses": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "range": {
                        "type": "stat_block_section",
                        "subtype": "range",
                        "range": 60,
                        "text": "60 ft.",
                        "unit": "feet"
                    },
                    "name": "darkvision"
                }
            ]
        },
        "defense": {
            "type": "stat_block_section",
            "subtype": "defense",
            "hp": {
                "type": "stat_block_section",
                "subtype": "hitpoints",
                "hp": 150
            },
            "ac": {
                "type": "stat_block_section",
                "subtype": "armor_class",
                "eac": 23,
                "kac": 24
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 11
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 9
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 13
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "void adaptation"
                }
            ]
        },
        "offense": {
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "ability_type": "Supernatural",
                        "ability_type_abbrev": "Su",
                        "maneuverability": "perfect",
                        "name": "fly 60 ft.",
                        "movement_type": "fly",
                        "value": 60
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "acid touch",
                    "bonus": 21,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d8+10",
                            "damage_type": "Acid",
                            "damage_type_text": "A"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d6",
                            "critical": true,
                            "effect": "corrode"
                        }
                    ]
                }
            ],
            "space": "10 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "15 ft."
            },
            "offensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "offensive_ability",
                    "name": "reshape matter"
                }
            ]
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 0,
            "dex": 8,
            "con": 0,
            "int": 5,
            "wis": 3,
            "cha": 0,
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Acrobatics",
                        "value": 24,
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "+32 to fly"
                            }
                        ]
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Engineering",
                        "value": 19
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Life Science",
                        "value": 24
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Mysticism",
                        "value": 19
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Physical Science",
                        "value": 24
                    }
                ]
            },
            "other_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "other_ability",
                    "name": "traverse space"
                }
            ]
        },
        "ecology": {
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "the Drift",
            "organization": "solitary"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "A Drift architect has extensive control over the matter in its vicinity and can deconstruct it at will. As a full action while in the Drift, a Drift architect can reshape the matter in a 30-foot cone. Each creature and unattended object in the area that is not native to the Drift must succeed at a DC 19 Fortitude save or take 6d10 acid damage; this damage ignores hardness and nonmagical damage reduction. A creature that fails this save by 5 or more is also subject to the wound critical hit effect; that creature can attempt an additional save against that effect at the same DC.",
                "name": "Reshape Matter",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "Once per day as a full action, a Drift architect can teleport through the Drift instantaneously, appearing wherever it wishes with perfect accuracy. It can bring up to 6 willing or unconscious creatures with it, as per <i>teleport</i>.",
                "name": "Traverse Space",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su"
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Alien Archive 3",
            "link": {
                "type": "link",
                "name": "Alien Archive 3 pg. 24",
                "alt": "Alien Archive 3 pg. 24",
                "href": "https://paizo.com/products/btq01wt9?Starfinder-Alien-Archive-3"
            },
            "page": 24
        }
    ]
}