{
    "name": "Hobkins Gremlin",
    "type": "alien",
    "sections": [
        {
            "name": "Description",
            "type": "section",
            "html": "Gremlins delight in mayhem and destruction, and hobkins find particularly malicious glee in manipulating others into destroying their own equipment. With their mottled gray skin and round, glowing eyes, hobkins blend into the shadows and observe the best ways to encourage frustration and ruin. These patient creatures will often lie in wait for the perfect moment to pop up and startle an unwitting victim into dropping something delicate or valuable before they fade back into their hiding place. Once the target of their mischief is riled up after several such unexpected interruptions, a hobkins might appear again, just out of reach, to draw the frustrated victim’s ire—which can often result in the person shooting a cherished item in the same room.<br/><br/> A cunning hobkins might cause a stir without even showing itself. These slight creatures use their spell-like abilities to create a string of irritating but minor diversions, knowing that many beings will struggle to maintain a calm, rational state of mind as tension builds. A hobkins might use ghost sound to create feedback or disturbing noises that make a comm unit appear to be malfunctioning, or employ holographic image to display a “low battery” warning on an ammunition cartridge that is actually full, aware of the universal tendency to resort to “percussive maintenance” when technology is unreliable. Computer interfaces are favorite targets of these crafty gremlins as well, as they fool users into believing their keystrokes aren’t recording properly or their touchscreens are frozen. Particularly insidious and creative hobkins have been known to use holographic image to display a convincing virus alert, snickering with glee from the shadows as a hapless technician is fooled into wiping their own computer.<br/><br/> Sporting large, bat-like ears, needle-like teeth, and spindly, elongated limbs, a hobkins stands about 3 feet tall and weighs 15 pounds. Sightings have been reported in various environments around the Pact Worlds and beyond, and while it’s not uncommon to encounter a lone hobkins, where there’s one there are often more. A gang of hobkins gremlins is problematic enough, but more than a handful poses a much more pressing concern: the potential presence of a hobkins malefactor.<br/><br/> Unlike the mottled gray hobkins, malefactors have swirling skin patterns reminiscent of galaxies in dark purple and blue hues, and their faceted, gem-like eyes glow with a disconcerting silver or red light. These slightly larger gremlins have strong psychic abilities and a keen interest in the workings and potential failings of technology. They are capable of coordinating full hobkins infestations to terrifying effect. A malefactor will often use stealth to go unnoticed and orchestrate events telepathically from a secure vantage point, but malefactors are ferocious if cornered. Not content with the simple destruction of small personalized items, malefactors utilize their stronger understanding of computers and engineering to direct full-scale assaults within warehouses, on starships, and even on planet-wide technological systems.<br/><br/> In one legendary encounter in the Diaspora, a hobkins infestation resulted in the destruction of the heavy freighter Hummingbird. Directed by a malefactor stowaway, hobkins gremlins moved systematically through the ship, leading its crew to believe their vessel was suffering from multiple malfunctions. Navigation appeared nonresponsive, life support seemed to be failing, shields were out of balance, and crew members saw error messages appear where there were no errors, leading them to race off to fix each apparent calamity. After manipulating the unlucky crew into sabotaging their own systems, the gremlins ensured the Hummingbird was locked into a collision course with one of many large asteroids in the Diaspora before finally allowing the crew to see something real: thirty hobkins gremlins with evil grins waving from within the escape pods. Panicked, the crew ejected the pods from the ship, hoping to rid themselves of the creatures—unwittingly ensuring the hobkins’ survival as their final action before impact. Wary spacefarers view this incident as a cautionary tale, and search for signs of the presence of hobkins gremlins when faced with unexplained technological glitches on their ships.<br/><br/> Scholars have yet to establish whether malefactors are hobkins that have undergone a psychic apotheosis or are a completely different species of gremlin with traits in common with hobkins. Attempts to capture and study any type of gremlin usually end in disaster. Recently, several think tanks have taken more diplomatic approaches, luring in hobkins by setting up delicate sensors and computers in areas known to be infested with the gremlins and simply waiting. When things begin to go haywire, the scientists try to speak with the hobkins to learn more about them. This tactic has also yielded little success so far, and in one terrifying case, garnered the attention of a particularly cruel malefactor, who proceeded to cause a meltdown in the facility’s core nuclear reactor."
        }
    ],
    "game-obj": "Aliens",
    "stat_block": {
        "name": "Hobkins Gremlin",
        "type": "stat_block",
        "image": {
            "type": "image",
            "name": "Hobkins Gremlin",
            "game-obj": "Monster",
            "image": "AA3_Gremlin_Hobkins.png"
        },
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 3
        },
        "creature_type": {
            "name": "creature_type",
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Fey",
            "alignment": "Neutral Evil",
            "size": "Small",
            "family": "Gremlin",
            "cr": "1/2",
            "role": "Spellcaster",
            "xp": 200
        },
        "senses": {
            "name": "Senses",
            "type": "stat_block_section",
            "subtype": "senses",
            "perception": {
                "name": "Perception",
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 4
            },
            "special_senses": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "name": "Special Sense",
                    "value": "low-light vision"
                }
            ]
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "hp": {
                "name": "hitpoints",
                "type": "stat_block_section",
                "subtype": "hitpoints",
                "hp": 11
            },
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "eac": 9,
                "kac": 10
            },
            "saves": {
                "name": "Saves",
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 2
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 2
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 3
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "text": "out of phase"
                }
            ],
            "dr": {
                "type": "stat_block_section",
                "subtype": "dr",
                "value": 5,
                "text": "cold iron"
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "bite",
                    "bonus": 1,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4–1",
                            "damage_type": "Piercing",
                            "damage_type_text": "P"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "claw",
                    "bonus": 1,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4–1",
                            "damage_type": "Slashing",
                            "damage_type_text": "S"
                        }
                    ]
                }
            ]
        },
        "statistics": {
            "name": "Statistics",
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": -1,
            "dex": 3,
            "con": 0,
            "int": 1,
            "wis": 1,
            "cha": 2,
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "name": "Skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Acrobatics",
                        "value": 4
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Intimidate",
                        "value": 9
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 9
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "name": "Languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Aklo"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    }
                ]
            },
            "other_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "other_ability",
                    "text": "collateral damage"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "other_ability",
                    "text": "minor levitation"
                }
            ]
        },
        "ecology": {
            "name": "Ecology",
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "any",
            "organization": "solitary, gang (2–5), or infestation (6–30 plus one malefactor)"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "Whenever an attack fails to damage a hobkins, whether due to a low attack roll, a miss chance, or a failure to penetrate DR, the hobkins can redirect the attack to any target in range of the original attack (if any), including objects. The attack can’t be redirected against the original attacker, though it can be redirected against the original attacker’s gear (but not the weapon used to make the original attack). The attacker rolls a new attack and damage roll against the new target, and the attack is considered to have the penetrating weapon special quality.",
                "name": "Collateral Damage",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "A hobkins floats about 1 inch about the ground, allowing it to ignore difficult terrain. As a move action, a hobkins can levitate up to 20 feet straight up, but at the end of the movement, unless it has found something to cling to, it returns to 1 inch above the nearest flat surface below it.",
                "name": "Minor Levitation",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "Hobkins exist slightly out of phase with the Material Plane, causing all ranged attacks against them to suffer a 50% miss chance. This ability functions as <i>displacement</i>.",
                "name": "Out of Phase",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su"
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Alien Archive 3",
            "link": {
                "type": "link",
                "name": "Alien Archive 3 pg. 44",
                "alt": "Alien Archive 3 pg. 44",
                "href": "https://paizo.com/products/btq01wt9?Starfinder-Alien-Archive-3"
            },
            "page": 44
        }
    ]
}