{
    "name": "Vracinea",
    "type": "alien",
    "sections": [
        {
            "name": "Description",
            "type": "section",
            "html": "The vracinea is one such predator, a shambling plant creature with several fanged mouths and large blossoms that both attract living creatures with psychic impulses and exude a scent that holds prey in place. Standing almost 12 feet tall, a typical vracinea weighs 2,000 pounds, though one currently digesting a victim might be heavier.<br/><br/> Usually, a vracinea forsakes its mobility to lie in wait for its next meal, covering its lower half with nearby vines and branches and leaving only its blossom lures visible. If possible, it situates itself in a clearing or at the top of a rise to maximize its hunting range. Once its mesmerized prey has gotten close to it, the vracinea allows its flowers’ paralyzing odor to wash over its victim before the plant creature bursts forth from its camouflage and attacks. If an injured prey manages to shake off the scent’s effects and attempts to escape, the vracinea will pursue as best it can for a short time before giving up and beginning its hunting cycle over again, often selecting a new location in the process.<br/><br/> Xenobotanists aren’t certain of the mechanisms behind a vracinea’s blossom lures, as only a few scientists who set out to study these plant creatures have returned with evidence. Some believe the flowers vibrate at an almost subatomic level, stimulating a target’s subconscious desires, while others think that the vracinea transmits psychic impulses to its prey through the flowers. Either way, affected creatures can’t help but move toward the vracinea until they get caught within the plant’s paralyzing scent aura, after which they are quickly devoured.<br/><br/> Vracineas are solitary and territorial creatures. When two come into contact, they often charge at one another, quickly becoming locked in a struggle of gnashing teeth until one falls dead or retreats to nurse its wounds. The stakes of such skirmishes can be especially high, given that nearby prey are often unable to resist the draw of both creatures and end up standing by, paralyzed. The winning vracinea claims any such prizes and claims the nearby territory. It then picks a new hiding spot and patiently waits for other victims to appear. Rarely, a starving vracinea—easily recognizable by the deep purple coloration of its blossom lures—will pursue, kill, and feast on the loser of a contest of dominance, though this is the only time a vracinea partakes in cannibalism. In fact, a vracinea usually refuses to eat other plant creatures; xenobotanists believe those that do are in fact attempting to reach unabsorbed meat in the other creature’s system.<br/><br/> On Castrovel, vracineas flourish on the continent of Ukulam, where they can stake expansive hunting grounds and avoid other voracious members of their species. All is not completely peaceful, however, as many vracineas compete for food with the jungle’s other carnivorous creatures, such as tentacled ksariks and serpentine mountain eels. Over many generations, ksariks have learned to detect the scent of vracineas from greater and greater distances, along with the knowledge that they have little to gain from ingesting a vracinea’s genetic information. In addition, the two plant creatures tend to be evenly matched, making any confrontation between the two dangerous for both. As a result, they generally only come into direct conflict in times of desperation, or occasionally when a ksarik is tracking victims infected by its carrion spores. Mountain eels, on the other hand, are often more powerful than vracineas, though the two only fight for resources if a vracinea attempts to claim part of a mountainside frequented by a bed of mountain eels for its hunting ground. Usually outnumbered, a vracinea is quickly dispatched by mountain eels, but occasionally one of the plant creatures discovers a nest of newly born elvers left behind by its parents and enjoys a grand feast."
        }
    ],
    "game-obj": "Aliens",
    "stat_block": {
        "name": "Vracinea",
        "type": "stat_block",
        "image": {
            "type": "image",
            "name": "Vracinea",
            "game-obj": "Monster",
            "image": "AA3_Vracinea.png"
        },
        "initiative": {
            "name": "Initiative",
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 3
        },
        "creature_type": {
            "name": "creature_type",
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Plant",
            "alignment": "Neutral",
            "size": "Large",
            "cr": "4",
            "role": "Combatant",
            "xp": 1200
        },
        "senses": {
            "name": "Senses",
            "type": "stat_block_section",
            "subtype": "senses",
            "perception": {
                "name": "Perception",
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 10
            },
            "special_senses": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_sense",
                    "name": "low-light vision"
                }
            ]
        },
        "aura": "paralyzing scent (15 ft., Fortitude DC 13)",
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "hp": {
                "name": "hitpoints",
                "type": "stat_block_section",
                "subtype": "hitpoints",
                "hp": 51
            },
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "eac": 16,
                "kac": 18
            },
            "saves": {
                "name": "Saves",
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 8
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 6
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 3
                }
            },
            "immunities": [
                {
                    "name": "Immunity",
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "value": "plant immunities"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "15 ft.",
                        "movement_type": "walk",
                        "value": 15
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "bite",
                    "bonus": 12,
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d6+9",
                            "damage_type": "Piercing",
                            "damage_type_text": "P"
                        }
                    ]
                }
            ],
            "space": "10 ft.",
            "reach": {
                "name": "Reach",
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "10 ft."
            },
            "offensive_abilities": [
                {
                    "name": "Offensive Ability",
                    "type": "stat_block_section",
                    "subtype": "offensive_ability",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "120 feet"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "Will DC 13"
                        }
                    ],
                    "value": "lure"
                }
            ]
        },
        "statistics": {
            "name": "Statistics",
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 5,
            "dex": 3,
            "con": 1,
            "int": -4,
            "wis": 0,
            "cha": 0,
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "name": "Skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Athletics",
                        "value": 10
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 15
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Survival",
                        "value": 10
                    }
                ]
            }
        },
        "ecology": {
            "name": "Ecology",
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "temperate and warm forests (Castrovel)",
            "organization": "solitary"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "Each living creature within 120 feet of a vracinea that can see its violet blossoms must succeed at a DC 13 Will save each round at the beginning of its turn or be drawn toward the plant. An affected target must use 2 move actions each round to move directly toward the vracinea at its full speed, and it can’t move in such a way that it loses line of sight to the vracinea. If the only path to the vracinea passes through terrain that could harm the target (such as a river of lava or a bed of sharp thorns), the target can attempt an additional saving throw to shake off the effect before moving into the dangerous area. An affected creature within 5 feet of the vracinea can take no actions and offers no resistance to the vracinea’s attacks. Once a creature successfully saves against this effect, it is immune to the same vracinea’s lure ability for 24 hours. This is a mind-affecting, sense-dependent effect.",
                "name": "Lure",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su"
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "text": "A vracinea constantly exudes a sweet odor to a radius of 15 feet. Any living creature with a sense of smell that enters or starts its turn in this area of effect must succeed at a DC 13 Fortitude save or be paralyzed for 1 round. Once a creature successfully saves against this effect, it is immune to the same vracinea’s paralyzing scent for 24 hours. This is an inhaled poison effect.",
                "name": "Paralyzing Scent",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex"
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Alien Archive 3",
            "link": {
                "type": "link",
                "name": "Alien Archive 3 pg. 130",
                "alt": "Alien Archive 3 pg. 130",
                "href": "https://paizo.com/products/btq01wt9?Starfinder-Alien-Archive-3"
            },
            "page": 130
        },
        {
            "type": "source",
            "name": "Starfinder #1: Incident at Absalom Station",
            "link": {
                "type": "link",
                "name": "Starfinder #1: Incident at Absalom Station pg. 60",
                "alt": "Starfinder #1: Incident at Absalom Station pg. 60",
                "href": "https://paizo.com/products/btpy9tmf?Starfinder-Adventure-Path-Incident-at-Absalom-Station"
            },
            "page": 60
        }
    ]
}